Revit 2024 API
ParameterTypeId.WallHeightType Property
 "Top Constraint"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId WallHeightType { get; }
Visual Basic
Public Shared ReadOnly Property WallHeightType As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ WallHeightType {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace